core/app/Controllers/Admin.php

UPDATE `submenu` SET `Submenuid` = '11', `Tittle` = 'Maintenance Calendar', `Url` = 'managements/calendar'
WHERE `submenu`.`Submenuid` IN ('11')
---
    public function submenu()
    {
        if ($this->request->getPost('submenu')) {
            $data = [
                'Tittle' => $this->request->getPost('submenu'),
                'Menu_id' => $this->request->getPost('menu'),
                'Url' => $this->request->getPost('url')
            ];

            $this->submenu->save($data);
            success_message('New sub menu added');
            return redirect_to('admin/menu');
        } else {
            $data = [
                'Submenuid' => $this->request->getPost('submenuid'),
                'Tittle' => $this->request->getPost('esubmenu'),
                'Url' => $this->request->getPost('eurl')
            ];

            $this->submenu->save($data);