core/app/Controllers/Auth.php

    public function login()
    {
        $id = $this->request->getPost('username');
        $pass = $this->request->getPost('password');
        $udata = $this->UserModel->find($id);
        if ($udata) {
            $role = $this->rolemodel->find($udata['Role_id']);
            if ($udata['Active'] == 1) {
                if (password_verify($pass, $udata['Password'])) {
                    $s_data = [
                        'uid' => $udata['Userid'],
                        'roleid' => $udata['Role_id']
                    ];
                    $date = [
                        'Userid' => $udata['Userid'],
                        'Lastlogin' => date('Y-m-d H:i:s', time())
                    ];
                    $this->UserModel->save($date);
---
SELECT *
FROM `user`
WHERE `user`.`Userid` = 'supervisor1'
UPDATE `user` SET `Userid` = 'Supervisor1', `Lastlogin` = '2025-08-29 16:33:22'
WHERE `user`.`Userid` IN ('Supervisor1')