core/app/Controllers/Management.php

    public function calendar($id = null)
    {
        if ($id == 'lsw') {
            $lsw = date('W', strtotime(curr_date())) - 1;
            $year = date('Y', strtotime(curr_date()));
            $data['scho'] = $this->task->where(['Status !=' => 3, 'WEEK(Duedate)' => $lsw, 'YEAR(Duedate)' => $year, 'TaskType' => 2])->findAll();
            $data['backlog'] = $this->task->where(['Status ' => 0, 'WEEK(Duedate)' => $lsw, 'YEAR(Duedate)' => $year, 'TaskType' => 2])->findAll();
            $data['close'] = $this->task->where(['Status ' => 3, 'WEEK(Duedate)' => $lsw, 'YEAR(Duedate)' => $year, 'TaskType' => 2])->findAll();
        } elseif ($id == 'tsw') {
            $tsw = date('W', strtotime(curr_date()));
            $year = date('Y', strtotime(curr_date()));
            $data['scho'] = $this->task->where(['Status !=' => 3, 'WEEK(Duedate)' => $tsw, 'YEAR(Duedate)' => $year, 'TaskType' => 2])->findAll();
            $data['backlog'] = $this->task->where(['Status ' => 0, 'WEEK(Duedate)' => $tsw, 'Duedate <' => date('Y-m-d'), 'YEAR(Duedate)' => $year, 'TaskType' => 2])->findAll();
            $data['close'] = $this->task->where(['Status ' => 3, 'WEEK(Duedate)' => $tsw, 'YEAR(Duedate)' => $year, 'TaskType' => 2])->findAll();
        } elseif ($id == 'tsm') {
            $tsm = date('m', strtotime(curr_date()));
            $year = date('Y', strtotime(curr_date()));
            $data['scho'] = $this->task->where(['Status !=' => 3, 'MONTH(Duedate)' => $tsm, 'YEAR(Duedate)' => $year, 'TaskType' => 2])->findAll();
            $data['backlog'] = $this->task->where(['Status ' => 0, 'MONTH(Duedate)' => $tsm, 'Duedate <' => date('Y-m-d'), 'YEAR(Duedate)' => $year, 'TaskType' => 2])->findAll();
            $data['close'] = $this->task->where(['Status ' => 3, 'MONTH(Duedate)' => $tsm, 'YEAR(Duedate)' => $year, 'TaskType' => 2])->findAll();
        } else {
            $date = date('Y-m-d');
            $data['scho'] = $this->task->where(['Status !=' => 3, 'TaskType' => 2])->findAll();
            $data['backlog'] = $this->task->where(['Status ' => 0, 'Duedate <' => $date, 'TaskType' => 2])->findAll();
---
SELECT *
FROM `task`
WHERE `Status` IN (0,1,2)
SELECT *
FROM `task`
WHERE `Status` != 3
AND `TaskType` = 2
SELECT *
FROM `task`
WHERE `Status` = 0
AND `Duedate` < '2025-08-10'
AND `TaskType` = 2

    public function equipment()
    {
        if ($this->request->getPost('locname')) {
            $data = [
                'Name' => $this->request->getPost('locname')
            ];
            $this->location->save($data);
            success_message('New location added');
            return redirect_to('managements/equipment');
        } elseif ($this->request->getPost('equipmetdidx')) {
            $id = $this->request->getPost('equipmetdidx');
            $data = $this->equipment->find($id);
---
SELECT *
FROM `equipment`
WHERE `equipment`.`Equipmentid` = '1'

        } else {
            $data['title'] = 'Equipment';
            $data['prof'] = profile();
            $data['equip'] = $this->equipment->findAll();
            $data['subloc'] = $this->sublocation->findAll();
            $data['loc'] = $this->location->findAll();
            $data['sup'] = $this->supplier->findAll();
---
SELECT *
FROM `equipment`
SELECT *
FROM `sublocation`
SELECT *
FROM `location`
SELECT *
FROM `supplier`

    public function woreport($id)
    {
        $task = $this->task->find($id);
        if ($task['TaskType'] == 3) {
            $data['equip'] = $this->equipment->find($task['Equipment_id']);
            $data['period'] = $this->period->find($task['Periode_id']);
            $data['loc'] = $this->location->find($task['Location_id']);
            $data['subloc'] = $this->sublocation->find($task['Sublocation_id']);
            $data['checklist'] = $this->check->where('Type_id', $task['Type_id'])->findAll();
            $data['task'] = $task;
            $data['cat'] = $this->category->find($task['TaskType']);
            $data['det'] = $this->cmdetail->where('Task_id', $task['Taskid'])->findAll();
---
SELECT *
FROM `task`
WHERE `task`.`Taskid` = '16'
SELECT *
FROM `equipment`
WHERE `equipment`.`Equipmentid` = '3'
SELECT *
FROM `location`
WHERE `location`.`Locationid` = '24909'
SELECT *
FROM `sublocation`
WHERE `sublocation`.`Sublocationid` = '2'
SELECT *
FROM `checklist`
WHERE `Type_id` IS NULL
SELECT *
FROM `cmdetail`
WHERE `Task_id` = '16'