core/app/Helpers/date_helper.php

function equipmentname($id)
{
    $db = \Config\Database::connect();
    $builder = $db->table('equipment');
    $builder->where('Equipmentid', $id);
    $data = $builder->get()->getRowArray();
---
SELECT *
FROM `equipment`
WHERE `Equipmentid` = '1'

function categoryname($id)
{
    $db = \Config\Database::connect();
    $builder = $db->table('maintcategory');
    $builder->where('Maintcategoryid', $id);
    $data = $builder->get()->getRowArray();
---
SELECT *
FROM `maintcategory`
WHERE `Maintcategoryid` = '2'